# -*- coding:utf-8 -*-

MONGO_URL = 'localhost'
MONGO_DB = 'xiecheng'
MONGO_TABLE = {
    '北京': 'beijing',
    '上海': 'shanghai',
    '天津': 'tianjin',
}

base_city = {
    '__VIEWSTATEGENERATOR': 'DB1FBB6D',
    'StartTime': '',
    'DepTime': '',
    'RoomGuestCount': '1%2C1%2C0',
    'operationtype': 'NEWHOTELORDER',
    'IsOnlyAirHotel': 'F',
    'htlPageView': '0',
    'hotelType': 'F',
    'hasPKGHotel': 'F',
    'requestTravelMoney': 'F',
    'isusergiftcard': 'F',
    'useFG': 'F',
    'priceRange': '-2',
    'promotion': 'F',
    'prepay': 'F',
    'IsCanReserve': 'F',
    'OrderBy': '99',
    'checkIn': '',
    'checkOut': '',
    'hidTestLat': '0%257C0',
    'HideIsNoneLogin': 'T',
    'isfromlist': 'T',
    'ubt_price_key': 'htl_search_result_promotion',
    'isHuaZhu': 'False',
    'htlFrom': 'hotellist',
    'markType': '0',
    'a': '0',
    'contrast': '0',
    'page': '2',
    'contyped': '0',
}

"""
城市需要修改的数据
'北京': 
    base_city.update(
        {
            'cityName': '',
            'cityId': '',
            'cityPY': '',
            'cityCode': '',
            'cityLat': '',
            'cityLng': '',
            'AllHotelIds': '',
            'hotelIds': '',
        }
    ),
"""

city_dict = {
    '北京':
        {
            'cityName': '%25E5%258C%2597%25E4%25BA%25AC',
            'cityId': '1',
            'cityPY': 'beijing',
            'cityCode': '010',
            'cityLat': '39.9105329229',
            'cityLng': '116.413784021',
            'AllHotelIds': '608345%252C375265%252C691682%252C457242%252C452197%252C375126%252C14095879%252C433114%252C1725911%252C1422167%252C427151%252C980123%252C2226967%252C431617%252C457112%252C457234%252C444199%252C1641390%252C439311%252C429492%252C1249518%252C445313%252C9444856%252C5389632%252C452221',
            'hotelIds': '608345_1_1%2C375265_2_1%2C691682_3_1%2C457242_4_1%2C452197_5_1%2C375126_6_1%2C14095879_7_1%2C433114_8_1%2C1725911_9_1%2C1422167_10_1%2C427151_11_1%2C980123_12_1%2C2226967_13_1%2C431617_14_1%2C457112_15_1%2C457234_16_1%2C444199_17_1%2C1641390_18_1%2C439311_19_1%2C429492_20_1%2C1249518_21_1%2C445313_22_1%2C9444856_23_1%2C5389632_24_1%2C452221_25_1',
        },
    '上海':
        {
            'cityName': '%25E4%25B8%258A%25E6%25B5%25B7',
            'cityId': '2',
            'cityPY': 'shanghai',
            'cityCode': '021',
            'cityLat': '31.2363508011',
            'cityLng': '121.4802384079',
            'AllHotelIds': '387009%252C8052290%252C428365%252C6245432%252C437892%252C12603011%252C455065%252C436187%252C425161%252C2895314%252C6081776%252C4399431%252C3792196%252C11411201%252C4508305%252C4119594%252C6504018%252C12782071%252C456909%252C6338488%252C441585%252C6657909%252C1480696%252C686139%252C425164',
            'hotelIds': '387009_1_1%2C8052290_2_1%2C428365_3_1%2C6245432_4_1%2C437892_5_1%2C12603011_6_1%2C455065_7_1%2C436187_8_1%2C425161_9_1%2C2895314_10_1%2C6081776_11_1%2C4399431_12_1%2C3792196_13_1%2C11411201_14_1%2C4508305_15_1%2C4119594_16_1%2C6504018_17_1%2C12782071_18_1%2C456909_19_1%2C6338488_20_1%2C441585_21_1%2C6657909_22_1%2C1480696_23_1%2C686139_24_1%2C425164_25_1',
        },
    '天津':
        {
            'cityName': '%25E5%25A4%25A9%25E6%25B4%25A5',
            'cityId': '3',
            'cityPY': 'tianjin',
            'cityCode': '022',
            'cityLat': '39.123193',
            'cityLng': '117.221183',
            'AllHotelIds': '531644%252C512546%252C713104%252C712892%252C446065%252C429200%252C431412%252C533028%252C397131%252C432349%252C712896%252C430230%252C607182%252C2085250%252C470545%252C1592078%252C5722352%252C953350%252C1580356%252C437815%252C13326546%252C747028%252C1355078%252C11887003%252C434946',
            'hotelIds': '531644_1_1%2C512546_2_1%2C713104_3_1%2C712892_4_1%2C446065_5_1%2C429200_6_1%2C431412_7_1%2C533028_8_1%2C397131_9_1%2C432349_10_1%2C712896_11_1%2C430230_12_1%2C607182_13_1%2C2085250_14_1%2C470545_15_1%2C1592078_16_1%2C5722352_17_1%2C953350_18_1%2C1580356_19_1%2C437815_20_1%2C13326546_21_1%2C747028_22_1%2C1355078_23_1%2C11887003_24_1%2C434946_25_1',
        }
}

url_dict = {
    '北京': 'http://hotels.ctrip.com/hotel/beijing1#ctm_ref=ctr_hp_sb_lst',
    '上海': 'http://hotels.ctrip.com/hotel/shanghai2#ctm_ref=hod_hp_sb_lst',
    '天津': 'http://hotels.ctrip.com/hotel/tianjin3#ctm_ref=hod_hp_sb_lst',
}
